Revit 2027 API
ApplicationEntryPoint.AddinFolder Property
 The full path to the Revit Macros module.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AddinFolder { get; }
Public ReadOnly Property AddinFolder As String
	Get
public:
virtual property String^ AddinFolder {
	String^ get () sealed;
}
abstract AddinFolder : string with get
override AddinFolder : string with get
Property Value
String
Implements
IEntryPoint.AddinFolder
Remarks
 This path should be used instead of the .NET GetExecutingAssembly() result, because the Macros module is loaded in such a way to make that result unreliable.
See Also
Reference
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace